content/posts/cai2016.md
+++
title = "cai2016 | The Foldability of Cylindrical Foldable Structures Based on Rigid Origami"
author = ["João Gutemberg Farias"]
draft = false
+++

The authors develop a method to check for the rigid foldability of multi-vertex cylindrical origami using dual quaternions. It's a multi step method, one of the steps uses quaternions and the other uses dual quaternions.


## Info {#info}

Foldable structures, a new kind of space structures developed in recent decades, can be deployed gradually to a working configuration, and also can be folded for transportation, thus have potentially broad application prospects in the fields of human life, military, aerospace, building structures and so on. Combined with the technology of origami folding, foldable structures derive more diversified models, and the foldable structures in cylindrical shape are mainly studied in this paper. Some researchers use the theory of quaternion representing spatial fixed-point rotation and construct the rotating vector model to obtain the quaternion rotation sequence method (QRS method) analyzing origami, but the method is very limited and not suitable for the cylindrical foldable structures. In order to solve the problem, a new method is developed, which combines the QRS method and the dual quaternion method. After analyzing the folding angle via the QRS method for multi-vertex crease system and calculating the coordinates of all vertices via the dual quaternion, the rigid foldability can be checked. Finally, two examples are carried out to confirm validity and versatility of the method.


## Notes {#notes}


### Resumo {#resumo}

The authors develop a method to check for the rigid foldability of multi-vertex cylindrical origami using dual quaternions. It's a multi step method, one of the steps uses quaternions and the other uses dual quaternions.
